"""
Задача №1:
Написать функцию hello, которая принимает 1 аргумент -
текст приветствия - и возвращает внутреннюю функцию.

Внутренняя функция принимает имя студента и возвращает
текст приветствия + имя студента с восклицательным знаком в конце.

Например:
>> greetings = hello('Привет')
>> print(greetings('Анфиса'))
Привет Анфиса!
"""

# Ваш код должен быть тут :)


def test_task_01():
    """
    Раскомментируйте строчки ниже, когда ваш код будет готов:
    """
    # greetings = hello('Привет')
    # actual_text = greetings('Анфиса')
    # expected_text = 'Привет Анфиса!'
    #
    # assert (
    #     actual_text == expected_text,
    #     f'Увы, должно быть {expected_text}, а у вас {actual_text}'
    # )
